Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: # Be sure to compile with --threads:on. # The channels and threads modules are part of system and should not be # imported. import os # Channels can either be: # - declared at the module level, or # - passed to procedures by ptr (raw pointer) -- see note on safety. # # For simplicity, in this example a channel is declared at module scope. # Channels are generic, and they include support for passing objects between # threads. # Note that objects passed through channels will be deeply copied. var chan: Channel[string] # This proc will be run in another thread using the threads module. proc firstWorker() =
ja: # 必ず --threads:on を付けてコンパイルしてください。 # channels と threads モジュールは system モジュールの一部であるため # インポートしないでください。 import os # いずれかの方法でチャンネルを使えます: # ・モジュールレベルでの宣言、 # ・または ptr によるプロシージャ渡し (生ポインタ) － 安全性については注釈を参照してください。 # # 簡潔にするために、この用例ではモジュールのスコープでチャンネルを宣言しています。 # チャンネルは一般的なものであり、チャンネル間での # オブジェクト渡しに関するサポートもあります。 # スレッドを通じて渡されたオブジェクトはディープコピーされることに注意してください。 var chan: Channel[string] # ここでは threads モジュールを用いて、別のプロシージャを別のスレッドで実行します。 proc firstWorker() =

source: # Module A type
ja: # モジュール A type

source: # Module A var x*: string
ja: # モジュール A var x*: string

source: # Module B import A # A is not parsed here!
ja: # モジュール B import A # A is not parsed here!

source: # Module B var x*: int
ja: # モジュール B var x*: int

source: # Module C import A, B write(stdout, x) # error: x is ambiguous write(stdout, A.x) # no error: qualifier used var x = 4 write(stdout, x) # not ambiguous: uses the module C's x
ja: # モジュール C import A, B write(stdout, x) # error: x is ambiguous write(stdout, A.x) # no error: qualifier used var x = 4 write(stdout, x) # not ambiguous: uses the module C's x

source: # This is a comment echo "What's your name?
ja: # これはコメントです echo "What's your name?

source: # module A import B export B.MyObject proc `$`*(x: MyObject): string = "my object"
ja: # モジュール A import B export B.MyObject proc `$`*(x: MyObject): string = "my object"

source: # module B type MyObject* = object
ja: # モジュール B type MyObject* = object

source: # module C import A # B.MyObject has been imported implicitly here: var x: MyObject echo $x
ja: # モジュール C import A # B.MyObject has been imported implicitly here: var x: MyObject echo $x

source: # module-wide policy to change the failed assert # exception type in order to include a lineinfo onFailedAssert(msg):
ja: # lineinfo があるときに例外型で失敗するよう # モジュール規模の方針を変更します onFailedAssert(msg):

source: # pretty prints the Nim AST echo renderTree(someNode) # outputs some JSON representation debug(someNode) # pretty prints some type echo typeToString(someType) debug(someType) echo symbol.name.s debug(symbol) # pretty prints the Nim ast, but annotates symbol IDs: echo renderTree(someNode, {renderIds}) if n.info ?? "temp.nim":
ja: # Nim 抽象構文木 (AST) の整形出力 echo renderTree(someNode) # JSON 形式で出力 debug(someNode) # 型の整形出力 echo typeToString(someType) debug(someType) echo symbol.name.s debug(symbol) # シンボル ID による注釈付きで Nim 抽象構文木 (AST) の整形出力: echo renderTree(someNode, {renderIds}) if n.info ?? "temp.nim":

source: ## Input (somefile.txt): ## The first line ## the second line ## the third line var f: File if open(f, "somefile.txt", fmRead, -1):
ja: ## 入力 (somefile.txt): ## 一行目 ## 二行目 ## 三行目 var f: File if open(f, "somefile.txt", fmRead, -1):

source: ## This module is a sample. import strutils proc helloWorld*(times: int) =
ja: ## このモジュールはサンプルです。 import strutils proc helloWorld*(times: int) =

source: <>a(href="http://nim-lang.org", newText("Nim rules."))
ja: <>a(href="http://nim-lang.org", newText("Nim のルール。"))

source: Deprecated since v0.18.0 Source Edit
ja: Deprecated since v0.18.0 ソース 編集

source: Must be called whenever svcMapMemory is used.
ja: svcMapMemory を使うときは必ず呼び出してください。

source: NOTE: The behaviour might change in future versions as it is not clear what "wild HTML the real world uses" really implies.
ja: 備考: 「実世界で使われている野良 HTML」の意味が曖昧なため、将来のバージョンで振る舞いが変更される場合があります。

source: Note: Breaking the fastRows() iterator during a loop will cause the next database query to raise a DbError exception unable to close due to ....
ja: 注意: fastRows() イテレータでループ処理中に次回のデータベース・クエリを破壊してしまい、 unable to close due to ... による DbError 例外が発生する原因となることがあります。

source: Note: Channels are designed for the Thread type.
ja: 備考: Channels は Thread 型として設計してあります。

source: Note: Channels cannot be passed between threads.
ja: 備考: Channels はスレッド間での受け渡しはできません。

source: Note: If you need a version of exec that returns the exit code and text output of the command, you can use system.gorgeEx.
ja: 備考: 終了コードを返してコマンドのテキストを出力する exec の派生版が必要ならば、 system.gorgeEx が使えます。

source: Note: Import nimsuggest/sexp to use this module
ja: 備考: このモジュールを使うには nimsuggest/sexp インポートをしてください

source: Note: Import packages/docutils/highlite to use this module
ja: 備考: このモジュールを使うには packages/docutils/highlite をインポートしてください。

source: Note: Import packages/docutils/rst to use this module
ja: 備考: このモジュールを使うには packages/docutils/rst をインポートしてください。

source: Note: Import packages/docutils/rstast to use this module
ja: 備考: このモジュールを使うには packages/docutils/rstast をインポートしてください。

source: Note: Import std/sha1 to use this module
ja: 備考: このモジュールを使うには std/sha1 をインポートしてください。

source: Note: Not available for JS backend.
ja: 備考: JavaScript バックエンドでは利用できません。

source: Note: Only the connection parameter is used for sqlite.
ja: 備考: connection パラメータは sqlite 専用です。

source: Note: The API of FutureStream is still new and so has a higher likelihood of changing in the future.
ja: 備考: FutureStream の API は開発されたばかりであるため、将来変更される可能性が高いです。

source: Note: The current implementation of message passing does not work with cyclic data structures.
ja: 備考: 現在のメッセージパッシングにおける実装では循環データ構造は動作しません。

source: Note: The encoding cannot be changed once it's been set.
ja: 備考: 設定後のエンコーディング変更はできません。

source: Note: The resulting XmlNode already uses the clientData field, so it cannot be used by clients of this library.
ja: 備考: XmlNode の結果として既存の clientData フィールドを使うため、このライブラリのクライアントで clientData フィールドは使えません。

source: Note: The server may return multiple lines of coded replies.
ja: 備考: サーバーからの応答として複数行から成るコードを返すことがあります。

source: Note: to serialize x to JSON use $(%x) from the json module.
ja: 備考: JSON から x へシリアライズするには json モジュールの $(%x) をお使いください。

source: Note: The to and $$ operations are available at compile-time!
ja: 備考: to と $$ 演算子はコンパイル時に利用可能です！

source: Note: The experimental features of Nim are covered here.
ja: 備考: こちらで Nim の試験的機能を解説しています。

source: Note: There are two approaches to parameter substitution support by this module.
ja: 備考: このモジュールではパラメータの置換方法を二通りサポートしています。

source: Note: This document is a draft!
ja: 備考: このドキュメントは草稿段階です！

source: Note: This is dangerous to use as it encourages races.
ja: 注意: このプロシージャは競合の助長となるため危険です。

source: Note: This is part of the system module.
ja: 備考: これは system モジュールの一部です。

source: Restriction: For objects their type is not serialized.
ja: 制限事項: オブジェクトでは型のシリアライズが行われません。

source: Since version 1.2.
ja: version 1.2 以降 でサポートしています。

source: WARNING: If the process has not finished executing, this will forcibly terminate the process.
ja: 警告: プロセスの実行が終了していないときに、これを行うと強制的にプロセスを終了します。

source: WARNING: This function uses poEvalCommand by default for backward compatibility.
ja: 警告: この関数は後方互換性の都合によりデフォルトでは poEvalCommand を使います。

source: WARNING: Be careful when using waitForExit for processes created without poParentStreams because they may fill output buffers, causing deadlock.
ja: 警告: デッドロックの発生により、出力バッファを使い切ってしまう原因となるため poParentStreamsを使わず作成したプロセスで waitForExit を使うときはご注意願います。

source: WARNING: The returned FileHandle should not be closed manually as it is closed when closing the Process p.
ja: 警告: 返された FileHandle はプロセス p を閉じるときに併せて閉じられますので手動では閉じないでください。

source: WARNING: The returned Stream should not be closed manually as it is closed when closing the Process p.
ja: 警告: 返された Stream はプロセス p を閉じるときに併せて閉じられますので手動では閉じないでください。

source: Warning: The buffer a must be pre-allocated.
ja: 警告: 事前にバッファ a の割り当てを必ず行ってください。

source: Warning: The tmpl argument is written to by mkstemp and thus can't be a string literal.
ja: 警告: tmpl アーギュメントは mkstemp により書き込まれるため、文字列リテラルの指定はできません。

source: Warning: This is not supported on UNIX!
ja: 警告: これは UNIX ではサポートされていません！

source: Warning: This really transforms the 'for' and unrolls the loop.
ja: 警告: これは本当に 'for' の変換とループの展開を行います。

source: escape [ESC]
ja: エスケープ [ESC]

source: import db_sqlite # user, password, database name can be empty. # These params are not used on db_sqlite module. let db = open("mytest.db", "", "", "") db.close()
ja: import db_sqlite # user, password, database の名称は無指定にできます。 # db_sqlite モジュールにおいて前述のパラメータは未使用です。 let db = open("mytest.db", "", "", "") db.close()

source: import experimental/diff # 2 samples of text for testing (from "The Call of Cthulhu" by Lovecraft) let txt0 = """I have looked upon all the universe has to hold of horror, even skies of spring and flowers of summer must ever be poison to me.""" let txt1 = """I have looked upon all your code has to hold of bugs, even skies of spring and flowers of summer must ever be poison to me.""" echo diffText(txt0, txt1)
ja: import experimental/diff # テスト用のサンプルテキスト (引用元: "The Call of Cthulhu" by Lovecraft") let txt0 = """I have looked upon all the universe has to hold of horror, even skies of spring and flowers of summer must ever be poison to me.""" let txt1 = """I have looked upon all your code has to hold of bugs, even skies of spring and flowers of summer must ever be poison to me.""" echo diffText(txt0, txt1)

source: import heapqueue var heap = initHeapQueue[int]() heap.push(8) heap.push(2) heap.push(5) # The first element is the lowest element assert heap[0] == 2 # Remove and return the lowest element assert heap.pop() == 2 # The lowest element remaining is 5 assert heap[0] == 5
ja: import heapqueue var heap = initHeapQueue[int]() heap.push(8) heap.push(2) heap.push(5) # 最初の要素は最下位の要素です assert heap[0] == 2 # 最下位の要素を削除して返します assert heap.pop() == 2 # 最下位の要素には 5 が残存します assert heap[0] == 5

source: import htmlparser import xmltree # To use '$' for XmlNode import strtabs # To access XmlAttributes import os # To use splitFile import strutils # To use cmpIgnoreCase proc transformHyperlinks() =
ja: import htmlparser import xmltree # XmlNode で '$' を使用 import strtabs # XmlAttributes へのアクセス import os # splitFile で使用 import strutils # cmpIgnoreCase で使用 proc transformHyperlinks() =

source: import strtabs, cgi # Fill the values when debugging: when debug:
ja: import strtabs, cgi # デバッグ用の値を記述します: when debug:

source: import xmltree var g = newElement("myTag") g.add newText("some text") g.add newComment("this is comment") var h = newElement("secondTag") h.add newEntity("some entity") let att = {"key1": "first value", "key2": "second value"}.toXmlAttributes let k = newXmlTree("treeTag", [g, h], att) echo k # <treeTag key2="second value" key1="first value"> # <myTag>some text<!-- this is comment --></myTag> # <secondTag>&some entity;</secondTag> # </treeTag>
ja: import xmltree var g = newElement("myTag") g.add newText("テキスト") g.add newComment("これはコメントです") var h = newElement("secondTag") h.add newEntity("エンティティ") let att = {"key1": "第一値", "key2": "第二値"}.toXmlAttributes let k = newXmlTree("treeTag", [g, h], att) echo k # <treeTag key2="第二値" key1="第一値"> # <myTag>テキスト<!-- これはコメントです --></myTag> # <secondTag>&エンティティ;</secondTag> # </treeTag>

source: let db = open("mytest.db", "", "", "") # Records of my_table: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | doAssert db.execAffectedRows(sql"UPDATE my_table SET name = 'TEST'") == 2 db.close()
ja: let db = open("mytest.db", "", "", "") # my_table のレコード: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | doAssert db.execAffectedRows(sql"UPDATE my_table SET name = 'TEST'") == 2 db.close()

source: let db = open("mytest.db", "", "", "") # Records of my_table: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | doAssert db.getAllRows(sql"SELECT id, name FROM my_table") == @[Row(@["1", "item#1"]), Row(@["2", "item#2"])] db.close()
ja: let db = open("mytest.db", "", "", "") # my_table のレコード: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | doAssert db.getAllRows(sql"SELECT id, name FROM my_table") == @[Row(@["1", "item#1"]), Row(@["2", "item#2"])] db.close()

source: let db = open("mytest.db", "", "", "") # Records of my_table: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | doAssert db.getRow(sql"SELECT id, name FROM my_table"
ja: let db = open("mytest.db", "", "", "") # my_table のレコード: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | doAssert db.getRow(sql"SELECT id, name FROM my_table"

source: let db = open("mytest.db", "", "", "") # Records of my_table: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | doAssert db.getValue(sql"SELECT name FROM my_table WHERE id = ?",
ja: let db = open("mytest.db", "", "", "") # my_table のレコード: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | doAssert db.getValue(sql"SELECT name FROM my_table WHERE id = ?",

source: let db = open("mytest.db", "", "", "") # Records of my_table: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | for row in db.fastRows(sql"SELECT id, name FROM my_table"):
ja: let db = open("mytest.db", "", "", "") # my_table のレコード: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | for row in db.fastRows(sql"SELECT id, name FROM my_table"):

source: let db = open("mytest.db", "", "", "") # Records of my_table: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | for row in db.instantRows(sql"SELECT * FROM my_table"):
ja: let db = open("mytest.db", "", "", "") # my_table のレコード: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | for row in db.instantRows(sql"SELECT * FROM my_table"):

source: let db = open("mytest.db", "", "", "") # Records of my_table: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | for row in db.rows(sql"SELECT id, name FROM my_table"):
ja: let db = open("mytest.db", "", "", "") # my_table のレコード: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | for row in db.rows(sql"SELECT id, name FROM my_table"):

source: let db = open("mytest.db", "", "", "") # Records of my_table: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | var columns: DbColumns for row in db.instantRows(columns, sql"SELECT * FROM my_table"):
ja: let db = open("mytest.db", "", "", "") # my_table のレコード: # | id | name | # |----|----------| # | 1 | item#1 | # | 2 | item#2 | var columns: DbColumns for row in db.instantRows(columns, sql"SELECT * FROM my_table"):

source: let outp = execProcess("nim", args=["c", "-r", "mytestfile.nim"], options={poUsePath}) let outp_shell = execProcess("nim c -r mytestfile.nim") # Note: outp may have an interleave of text from the nim compile # and any output from mytestfile when it runs
ja: let outp = execProcess("nim", args=["c", "-r", "mytestfile.nim"], options={poUsePath}) let outp_shell = execProcess("nim c -r mytestfile.nim") # outp には Nim のコンパイル、および実行時に # mytestfile から出力による交互配置されたテキストがあります。

source: static: assert 1 == 9, "This assertion generates code when not built with -d:danger or --assertions:off"
ja: static: assert 1 == 9, "このアサーションは -d:danger や --assertions:off でビルドされないときにコードを生成します"

source: static: doAssert 1 == 9, "This assertion generates code when built with/without -d:danger or --assertions:off"
ja: static: doAssert 1 == 9, "このアサーションは -d:danger や --assertions:off によるビルドの有無に関係なくコードを生成します"

source: var f = newElement("myTag") f.add newText("my text") f.add newComment("my comment") f.add newEntity("my entity") assert $f == "<myTag>my text<!-- my comment -->&my entity;</myTag>" assert innerText(f) == "my textmy entity"
ja: var f = newElement("myTag") f.add newText("テキスト") f.add newComment("コメント") f.add newEntity("エンティティ") assert $f == "<myTag>エンティティ<!-- コメント -->&エンティティ;</myTag>" assert innerText(f) == "テキストエンティティ"

source: var g = newElement("myTag") g.add newText("some text") g.add newComment("this is comment") var h = newElement("secondTag") h.add newEntity("some entity") let att = {"key1": "first value", "key2": "second value"}.toXmlAttributes var k = newXmlTree("treeTag", [g, h], att) echo k ## <treeTag key2="second value" key1="first value"> ## <myTag>some text<!-- this is comment --></myTag> ## <secondTag>&some entity;</secondTag> ## </treeTag> clear(k) echo k ## <treeTag key2="second value" key1="first value" />
ja: var g = newElement("myTag") g.add newText("テキスト") g.add newComment("これはコメントです") var h = newElement("secondTag") h.add newEntity("エンティティ") let att = {"key1": "第一値", "key2": "第二値"}.toXmlAttributes var k = newXmlTree("treeTag", [g, h], att) echo k ## <treeTag key2="第二値" key1="第一値"> ## <myTag>テキスト<!-- これはコメントです --></myTag> ## <secondTag>&エンティティ;</secondTag> ## </treeTag> clear(k) echo k ## <treeTag key2="第二値" key1="第一値" />

source: var g = newElement("myTag") g.add newText("some text") g.add newComment("this is comment") var h = newElement("secondTag") h.add newEntity("some entity") g.add h assert $g == "<myTag>some text<!-- this is comment --><secondTag>&some entity;</secondTag></myTag>" for x in g: # the same as `for x in items(g):`
ja: var g = newElement("myTag") g.add newText("テキスト") g.add newComment("これはコメントです") var h = newElement("secondTag") h.add newEntity("エンティティ") g.add h assert $g == "<myTag>テキスト<!-- これはコメントです --><secondTag>&エンティティ;</secondTag></myTag>" for x in g: # `for x in items(g):` と同じです

source: var g = newElement("myTag") g.add newText("some text") g.add newComment("this is comment") var h = newElement("secondTag") h.add newEntity("some entity") let att = {"key1": "first value", "key2": "second value"}.toXmlAttributes let k = newXmlTree("treeTag", [g, h], att) echo k ## <treeTag key2="second value" key1="first value"> ## <myTag>some text<!-- this is comment --></myTag> ## <secondTag>&some entity;</secondTag> ## </treeTag>
ja: var g = newElement("myTag") g.add newText("テキスト") g.add newComment("これはコメントです") var h = newElement("secondTag") h.add newEntity("エンティティ") let att = {"key1": "第一値", "key2": "第二値"}.toXmlAttributes let k = newXmlTree("treeTag", [g, h], att) echo k ## <treeTag key2="第二値" key1="第一値"> ## <myTag>テキスト<!-- これはコメントです --></myTag> ## <secondTag>&エンティティ;</secondTag> ## </treeTag>

source: tagDfn, ## the HTML ``dfn`` element
ja: tagDfn, ## HTML ``dfn`` 要素

source: dbPath, ## Closed or open path (similar to polygon) ((x1,y1),...)
ja: dbPath, ## クローズまたはオープンパス (多角形と類似) ((x1,y1),...)

source: deallocShared(channel) localChannelExample() # "Hello from the main thread!"
ja: deallocShared(channel) localChannelExample() # "メインスレッドから Hello!"

source: d_name*: array[0 .. 255, char] ## Name of entry.
ja: d_name*: array[0 .. 255, char] ## エントリ名。

source: st_mtime*: Time ## Time of last data modification.
ja: st_mtime*: Time ## データの最終修正時刻。

source: tagDialog, ## the HTML ``dialog`` element
ja: tagDialog, ## HTML ``dialog`` 要素

source: dbPolygon, ## Polygon (similar to closed path) ((x1,y1),...)
ja: dbPolygon, ## 多角形 (クローズパスと類似) ((x1,y1),...)

source: tagDiv, ## the HTML ``div`` element
ja: tagDiv, ## HTML ``div`` 要素

source: dbCircle, ## Circle <(x,y),r> (center point and radius)
ja: dbCircle, ## 円形 <(x,y),r> (中心点と半径)

source: st_ctime*: Time ## Time of last status change.
ja: st_ctime*: Time ## ステータスの最終変更時刻。

source: tagDir, ## the deprecated HTLM ``dir`` element
ja: tagDir, ## 廃止された HTML ``dir`` 要素

source: ai_family*: cint ## Address family of socket.
ja: ai_family*: cint ## ソケットのアドレスファミリー。

source: bgColor ## set background's true color
ja: bgColor ## トゥルーカラーによるターミナルの背景表示色の設定

source: dbNull, ## datatype used for the NULL value
ja: dbNull, ## NULL 値で使われるデータ型

source: errParensRiExpected, ## ``)`` expected
ja: errParensRiExpected, ## ``)`` を検出した

source: errStringExpected, ## string expected
ja: errStringExpected, ## 文字列を検出した

source: fpUserRead, ## read access for the file owner
ja: fpUserRead, ## ファイル所有者の読み取りアクセス権

source: jsonString, ## a string literal
ja: jsonString, ## 文字列リテラル

source: methodGet ## query uses the GET method
ja: methodGet ## GET メソッドの照会時に使用

source: notNull*: bool ## does the type contain NULL?
ja: notNull*: bool ## 型は NULL であるか？

source: pcDir, ## path refers to a directory
ja: pcDir, ## ディレクトリの参照パス

source: sexpString, ## a string literal
ja: sexpString, ## 文字列リテラル

source: startB*: int ## Start Line number in Data B.
ja: startB*: int ## データ B の開始行数。

source: tableName*: string ## name of the table the column belongs to (optional)
ja: tableName*: string ## カラムの所属先であるテーブルの名前 (オプション)

source: tagAbbr, ## the deprecated HTML ``abbr`` element
ja: tagAbbr, ## 廃止された HTML ``abbr`` 要素

source: xnCData, ## a CDATA node
ja: xnCData, ## CDATA ノード

source: dbUser1, ## user definable datatype 1 (for unknown extensions)
ja: dbUser1, ## ユーザ定義によるデータ型１ (未知のエクステンション)

source: tagDl, ## the HTML ``dl`` element
ja: tagDl, ## HTML ``dl`` 要素

source: dbUser2, ## user definable datatype 2 (for unknown extensions)
ja: dbUser2, ## ユーザ定義によるデータ型２ (未知のエクステンション)

source: tagDt, ## the HTML ``dt`` element
ja: tagDt, ## HTML ``dt`` 要素

source: dbUser3, ## user definable datatype 3 (for unknown extensions)
ja: dbUser3, ## ユーザ定義によるデータ型３ (未知のエクステンション)

source: tagEm, ## the HTML ``em`` element
ja: tagEm, ## HTML ``em`` 要素

source: fmReadWrite, ## Open the file for read and write access.
ja: fmReadWrite, ## 読み書きアクセス可能でファイルを開きます。

source: roSupportRawDirective, ## support the ``raw`` directive (don't support
ja: roSupportRawDirective, ## ``raw`` ディレクティブのサポート

source: dbUser4, ## user definable datatype 4 (for unknown extensions)
ja: dbUser4, ## ユーザ定義によるデータ型４ (未知のエクステンション)

source: tagEmbed, ## the HTML ``embed`` element
ja: tagEmbed, ## HTML ``embed`` 要素

source: dbUser5 ## user definable datatype 5 (for unknown extensions)
ja: dbUser5 ## ユーザ定義によるデータ型５ (未知のエクステンション)

source: st_blocks*: Blkcnt ## Number of blocks allocated for this object.
ja: st_blocks*: Blkcnt ## このオブジェクトに割り当てられたブロック数。

source: # For this example, sleep in order not to flood stdout with the above
ja: # この用例では、上述のメッセージを stdout で溢れさせないために

source: tagFieldset, ## the HTML ``fieldset`` element
ja: tagFieldset, ## HTML ``fieldset`` 要素

source: sleep(400) # Wait for the second thread to exit before cleaning up the channel. worker2.joinThread() # Clean up the channel. chan.close()
ja: sleep(400) # チャンネルのクリーンアップ前に第二スレッドの終了を待機します。 worker2.joinThread() # チャンネルのクリーンアップ。 chan.close()

source: tagFigcaption, ## the HTML ``figcaption`` element
ja: tagFigcaption, ## HTML ``figcaption`` 要素

source: ## Takes an integer and outputs
ja: ## "hello world!" の出力回数を

source: bgGreen, ## green
ja: bgGreen, ## 緑

source: fgGreen, ## green
ja: fgGreen, ## 緑

source: poEvalCommand, ## Pass `command` directly to the shell, without quoting.
ja: poEvalCommand, ## クォート処理なしで、シェルに `command` (コマンド) を渡します。

source: styleItalic, ## italic (or reverse on terminals not supporting)
ja: styleItalic, ## 斜体 (あるいはターミナルでサポートされていない反転表示)

source: tagFigure, ## the HTML ``figure`` element
ja: tagFigure, ## HTML ``figure`` 要素

source: tagFont, ## the deprecated HTML ``font`` element
ja: tagFont, ## 廃止された HTML ``font`` 要素

source: tagFooter, ## the HTML ``footer`` element
ja: tagFooter, ## HTML ``footer`` 要素

source: tagForm, ## the HTML ``form`` element
ja: tagForm, ## HTML ``form`` 要素

source: ## as many "hello world!"s
ja: ## 整数で指定します

source: Silent, ## Be silent.
ja: Silent, ## 無表示。

source: Windows, ## some version of Windows
ja: Windows, ## Windows のバージョン

source: arguments, ## experimental: the arguments passed after '-r'
ja: arguments, ## 試験機能: '-r' の後に渡される引数

source: buf*: string ## the buffer itself
ja: buf*: string ## バッファ本体

source: dbBit, ## bit datatype
ja: dbBit, ## ビットによるデータ型

source: errColonExpected, ## ``:`` expected
ja: errColonExpected, ## ``:`` を検出した
